Conf.Simple/src/InformationRegisters/SUI_ОтсканированныеШтрихкодыУпаковокДокументовОбмена/SUI_ОтсканированныеШтрихкодыУпаковокДокументовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_ОтсканированныеШтрихкодыУпаковокДокументовОбмена</name>
  <resources>
    <name>barcode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>barcode_full</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>barcode_base64</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>hash_owner</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>barcode_owner</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>id_good</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>id_property</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>id_unit</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>id_series</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>series_number</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Обработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>sid_doc</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>hash</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_ОтсканированныеШтрихкодыУпаковокДокументовОбмена/Forms/ФормаЗаписи/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	SUI_ИнтеграцияВКонфигурацию.УстановитьДействиеОткрытияИдентификаторов(ЭтотОбъект, "id_");
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(ТекущийОбъект.ДатаЗаписи) Тогда
		ТекущийОбъект.ДатаЗаписи = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если Не Запись.ИсходныйКлючЗаписи.Пустой() Тогда
		ТекущийОбъект.ДатаОбновления = ТекущаяДатаСеанса();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура hashНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	РасчитатьХешШтрихкода();
	
КонецПроцедуры

&НаКлиенте
Процедура barcodeПриИзменении(Элемент)
	
	РасчитатьХешШтрихкода();
	
КонецПроцедуры

&НаКлиенте
Процедура hash_ownerНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	РасчитатьХешШтрихкодаВладельца();
	
КонецПроцедуры

&НаКлиенте
Процедура barcode_ownerПриИзменении(Элемент)
	
	РасчитатьХешШтрихкодаВладельца();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РасчитатьХешШтрихкода()
	
	Запись.hash = РасчитатьХешШтрихкодаНаСервере(Запись.barcode);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьХешШтрихкодаВладельца()
	
	Запись.hash_owner = РасчитатьХешШтрихкодаНаСервере(Запись.barcode_owner);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РасчитатьХешШтрихкодаНаСервере(Штрихкод)
	
	Возврат SUI_ШтрихкодированиеВызовСервера.РасчитатьХешШтрихкода(Штрихкод);
	
КонецФункции

&НаКлиенте
Процедура SUI_Переопределяемый_ОткрытиеИдентификатора(Элемент, СтандартнаяОбработка)
	
	SUI_ИнтеграцияВКонфигурациюКлиент.ОткрытиеИдентификатора(Неопределено, 
		Элемент.ТекстРедактирования, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти
